0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet
	{
                type            flowRateInletVelocity;
		volumetricFlowRate	7.84e-5;	
		value		uniform	(0 0 0);
	}
	outlet1
        {
	        type    	flowRateOutletVelocity;
		volumetricFlowRate	3.72e-5;
		value		uniform (0 0 0);
        } 
        outlet2
        {
                type            flowRateOutletVelocity;
                volumetricFlowRate      1.09e-5;
                value           uniform (0 0 0);
        }
        outlet3
        {
                type            flowRateOutletVelocity;
                volumetricFlowRate      1.09e-5;
                value           uniform (0 0 0);
        }
        outlet4
        {
                type            flowRateOutletVelocity;
                volumetricFlowRate      1.94e-5;
                value           uniform (0 0 0);
	}

	wall_aorta
	{
		type		noSlip;
	}
}


// * ************************************************************************* //
