0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type	zeroGradient;	
    }  
    outlet1
    {
        type    zeroGradient;
	//type	fixedValue;
	//value 	uniform 0;
    }
    outlet2
    {
        type    zeroGradient;
	//type	fixedValue;
	//value 	uniform 0;
    }
    outlet3
    {
        type    zeroGradient;
	//type	fixedValue;
	//value 	uniform 0;
    }
    outlet4
    {
        type 	zeroGradient;
	//type	fixedValue;
	//value 	uniform 0;
    }
    wall_aorta
    {
        type 	zeroGradient;
    }
}

// ************************************************************************* //
