0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    allBoundary
    {
        type            fixedValue;
        value           nonuniform 0();
    }
    wall_aorta
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
1016771
(
0
0
0
0
0
0
0
0
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet1
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet2
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet3
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet4
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
